Revit 2024 API
EdgeArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual EdgeArrayIterator ReverseIterator()
Visual Basic
Public Overridable Function ReverseIterator As EdgeArrayIterator
Visual C++
public:
virtual EdgeArrayIterator^ ReverseIterator()
Return Value
Returns a backward moving iterator to the array.
See Also
EdgeArray Class
Autodesk.Revit.DB Namespace